[
    {
        "id": "1",
        "text": "A handful of years ago, I was a burned-out serial startup executive taking a nearly year-long sabbatical. This week, I was awarded Solutions Engineer of the Year at Vimeo's SKO, and I couldn’t be prouder.\r\n\r\nNot because I won SE of the Year—though I admit I feel surprisingly proud of that—but because I made the right choice for me: leaving the C-Suite (and many toxic colleagues) behind and going back to being “just” an SE.\r\n\r\nI made the decision because being a Solutions Engineer was the most fun I ever had working, and I couldn’t see any reason I wouldn’t do that again.\r\n\r\nSince then, my mental health, my marriage, my dog frisbee skills, my cooking, and pretty much every other facet of my life have improved infinitely compared to when I was an executive. I can confidently say the last several years have been some of the happiest of my adult life. \r\n\r\nWhat surprised me when I made the switch was how many SE hiring managers weren’t interested in someone whose previous job titles were COO and CSO.\r\nEric Brown took a chance on me—despite advice from some of his colleagues, who shared the same reservations others had: “This guy doesn’t really want to be an SE,” they all said. But he sensed I was genuine and gave me a shot. \r\nEric: Thank you.\r\n\r\nWhile our time together at Qumu was brief (what a dumpster fire that place was), I was fortunate to join him again when he moved to Vimeo. Alongside my AE partner of six years, Joe Safken (AE of the Year himself, by the way!), we’ve been on a roll. Thinking back, the last few years have been some of the most enjoyable of my 20+ years in the industry.\r\n[Shout-out to the Limelight Networks SE team circa 2007, which became the touchstone I reflected on during my sabbatical and inspired me to return to this role—those were good times!]\r\n\r\nI don’t post on LinkedIn often. I’m not interested in being an influencer or thought leader or any of that jazz, but I wanted to share this because I know many people can’t fathom leaving fancy titles and higher salaries for a “lesser” role, even if it would bring them more fun and fulfillment.\r\nIf that sounds like you, I urge you to reflect on what matters most in life.\r\n\r\nI’m a Solutions Engineer because I’m both good at it and I LOVE doing it. And it’s the best thing I can do for myself.\r\nYep, I’m proud of that.",
        "label": 1,
        "created_at": "2025-02-07 18:42:38"
    },
    {
        "id": "2",
        "text": "When I look back on my first year as a fractional, the words \"more good than not so good\" sum it up pretty nicely. On the good side I actually made a very nice living doing something I truly love—while not missing a single important moment of my personal life. But on the not so good side, being fractional is an expensive and risky career choice that is getting more competitive by the day. Fortunately I've never minded a little risk or a little competition, so I think I'll stick it out for awhile longer.",
        "label": 1,
        "created_at": "2025-02-07 18:46:16"
    },
    {
        "id": "3",
        "text": "My little one-person business made $30,000 in 30 hours in January 2023.\r\n\r\nI’m on pace to do the same – this week.\r\n\r\nHere are 5 things I subtracted to make more money per minute (steal these for your business):\r\n\r\nIn January 2023, I worked 30 hours. \r\n\r\nFor the month. \r\n\r\nThat breaks down to $16.67 per minute.\r\n\r\nHow?\r\n\r\nI did less, better. \r\n\r\nHere are 5 things I *stopped* doing that paid off:\r\n\r\n1. I stopped trying to do everything\r\n\r\nWhen you’re an entrepreneur, you’re forced to wear many hats. \r\n\r\nBut you run into big trouble thinking that all hats are equal. They’re not.\r\n\r\nEach day I ask myself this:\r\n\r\n“What’s the ONE thing you can do such that by doing makes everything else easier or unnecessary?”\r\n\r\nThis strips away the fat. Instead of thinking about 9,979,001 things I could be doing… \r\n\r\nI focus on 1 that can push the business forward the most. Then, I do that. \r\n\r\n(h/t Gary Keller)\r\n\r\n2. I stopped trying to “be everywhere”\r\n\r\nI used to think I needed to be active on all of the social channels.\r\n\r\nWhen I went all-in on LinkedIn and stopped posting elsewhere, my sales jumped fast – with less effort. \r\n\r\n3. I stopped being quiet about my client’s results\r\n\r\nMy first 4 years as a coach, I never shared anything publicly.\r\n\r\nI helped clients achieve amazing results – such as earning $96k in 90 days – but I never talked about it.\r\n\r\nI was happy to deliver on promises and help the next person.\r\n\r\nIn January 2023, I announced an offer, sharing a few of the results I helped people to achieve.\r\n\r\n👉 A student became 2x Employee of the Month, lost 14 lbs, and feels at peace\r\n\r\n👉 Another unmasked Imposter Syndrome to secure the 1st clients for her freelance consultant side gig and applied to a new job for the first time in 4 years \r\n\r\n👉 One student brought in $𝟱 𝗺𝗶𝗹𝗹𝗶𝗼𝗻 𝗶𝗻 𝗻𝗲𝘁 𝗻𝗲𝘄 𝗺𝗼𝗻𝗲𝘆 into his business\r\n\r\n…all of this in just 90 days!\r\n\r\nThat sparked a LOT of interest.\r\n\r\nWhat I’m going to say next seems obvious, but few of us rarely act on it:\r\n\r\n𝙃𝙤𝙬 𝙘𝙖𝙣 𝙖𝙣𝙮𝙤𝙣𝙚 𝙬𝙤𝙧𝙠 𝙬𝙞𝙩𝙝 𝙮𝙤𝙪 𝙞𝙛 𝙮𝙤𝙪 𝙙𝙤𝙣’𝙩 𝙨𝙝𝙖𝙧𝙚 𝙬𝙝𝙖𝙩 𝙮𝙤𝙪 𝙤𝙛𝙛𝙚𝙧? \r\n\r\nCandidly, I’m still working to do better with this. \r\n\r\n4. I stopped doing it alone.\r\n\r\nI started a mastermind for LinkedIn.\r\n\r\nWe share what works on the platform and support each other’s goals.\r\n\r\n5. I *never* stopped showing up.\r\n\r\nI write about lessons learned, authentic stories from my journey as an entrepreneur, and much more.\r\n\r\nAs a result, people trust me.\r\n\r\nThey trust me even more because I don’t just talk about the highlights…\r\n\r\nI share the lows too.\r\n\r\nWhen you show up consistently, people pay attention.\r\n\r\nWhen you deliver value consistently, 𝗽𝗲𝗼𝗽𝗹𝗲 𝗽𝗮𝘆 𝘆𝗼𝘂.\r\n\r\nThat’s it! \r\n\r\nThose are 5 things I subtracted to make more money per minute.\r\n\r\nIf you’d like help to make more money per minute in your business or career, DM me “MMPM” (‘more money per minute’)",
        "label": 0,
        "created_at": "2025-02-07 18:54:41"
    },
    {
        "id": "4",
        "text": "An insecure boss who thinks they know-it-all is one of the most demoralizing things you can ever encounter in your career. Leaders lacking in emotional intelligence often create toxic work environments. They are the top cause of unhappiness in the workplace. Great leaders build strong teams. They drive positive cultures and inspire people to be their best. They optimize the talent of others. It's about identifying and appreciating the differences each team member brings to the table. The synergy of all contributors leads to the best solution. Your success is a result of your team. Play to your team's strengths and everyone wins! Agree?",
        "label": 0,
        "created_at": "2025-02-07 19:04:50"
    },
    {
        "id": "5",
        "text": "A loving lesson from Heather Boyes.\r\n\r\n“Today my daughter changed her profile picture. After maybe 5 minutes I get a text …’ \r\n\r\nI didn’t know she was dating a black boy, did you?’\r\n\r\nIt took me all day to think up a response, which I didn’t send personally but thought I would share for anyone else that ‘may not know’.\r\n\r\nYes in fact I did know, but the color of his skin doesn’t define who he is. \r\n\r\nWhat does define who is he is how he treats my daughter.\r\n\r\nI see my daughter dating a boy that comes to my house and shows me nothing but respect (a big deal in my book). \r\n\r\nIt’s always Yes Ma’am, No Ma’am, we talk about football and baseball, he tells me bye when he leaves, and has not once shown me a lack of manners or respect.\r\n\r\nI see my daughter dating a boy who treats her good. He takes her on dates, to ballgames, out to eat… not to a club or partying on the weekends.\r\n\r\nI see my daughter dating a boy who takes her to church with him. Every Sunday. \r\n\r\nHe plays in the band, she sits with his family. \r\n\r\nHow many young men these days make church a priority? \r\n\r\nNone of the others have.\r\n\r\nHe doesn’t hit her, cuss her, lie to her, or make her cry. \r\n\r\nWould I rather her date a white boy that did, to keep from her dating another race? \r\n\r\nAbsolutely not.\r\n\r\nSo that’s my response to the question I was asked. \r\n\r\nAnd I know people have their own opinion, but at the end of the day, the fact that my daughter has someone that loves her and treats her like a queen makes me happy. \r\n\r\nThat’s something I’ve never had in my life and I’m glad she does.”",
        "label": 0,
        "created_at": "2025-02-07 19:24:14"
    },
    {
        "id": "6",
        "text": "\"I am sitting in my cruiser typing a report. \r\n\r\nThis woman just came up to me and asked me if she could talk to me for a second. \r\n\r\nI said, ‘Absolutely’ and got out of my cruiser to speak with her.\r\n\r\nThe very first thing she said was, ‘Your life matters to me.’\r\n\r\nShe said, 'I don't see you as a ‘white cop’ rather, I see you as human... we are all human, and we are all the same.'\r\n\r\nShe then asked me, ‘Could I give you a hug?’ Which I accepted.\r\n\r\nI told her, ‘Your life matters to me as well.’\r\n\r\nWe continued to chat for about twenty minutes about all that is going on in the world.\r\n\r\nDuring those twenty minutes… it wasn’t a cop and citizen… or a cop and a black citizen talking. \r\n\r\nIt was just two humans having a conversation.\r\n\r\nBefore she left, she gave me a small bible and told me, ‘I will be praying for you.’\r\nWe need more people in the world like this woman.\" ",
        "label": 0,
        "created_at": "2025-02-07 19:24:41"
    },
    {
        "id": "7",
        "text": "”Went for a quick bite to eat today, and while standing in line, I was asked by a large group of bikers to cut in front of them. \r\n\r\nI declined, but they insisted. \r\n\r\nAs I made my way past them they all thanked me and shook my hand, each one introducing themselves. \r\n\r\nWhen I got to the front, they asked if they could pray for me. Said a quick prayer for me and I for them. \r\n\r\nThey then tried to buy my lunch which I politely refused. \r\n\r\nGet to the counter to pay and the owner told me it was on the house. \r\n\r\nSo I dumped all the cash I had in the tip jar. \r\n\r\nWas a nice change of pace to feel appreciated and respected instead of feared or hated. \r\n\r\nThanks for making my day!!!”",
        "label": 0,
        "created_at": "2025-02-07 19:26:48"
    },
    {
        "id": "8",
        "text": "“This kid dialed 911 telling the dispatcher he was running away from home after an argument with his mother.\r\n\r\nThis officer arrived talked to the kid and went into his bedroom which was empty outside of a deflated blowup bed. \r\n\r\nThe young man essentially slept on the floor.\r\n\r\nThe officer encouraged the boy to stay home. \r\n\r\nThe child’s mother facing a tough financial hardship.\r\n\r\nThe officer left and soon returning with a bed, a television and a game system. \r\n\r\nThe child was elated beyond words. Not all angels wear wings! \r\n\r\nThank you officer!!!!”\r\n\r\nSource: Good Thinking",
        "label": 0,
        "created_at": "2025-02-07 19:27:27"
    },
    {
        "id": "9",
        "text": "It’s deeply saddening to witness years of hard work, innovation, and collaboration at Citrix being unravelled by private equity. While the value extraction may bring short-term gains for investors, it does little to benefit the customers, employees, partners, and the broader community that built and supported the Citrix success story.\r\n\r\nThe heart of any technology company lies in its people and the ecosystem that surrounds it—not just its financial returns. Seeing the impact this has on those who’ve dedicated their careers to Citrix is a stark reminder of the challenges our industry faces when long-term vision is traded for short-term profits.\r\n\r\nTo everyone affected: your contributions matter, and your legacy will endure far beyond these decisions.",
        "label": 1,
        "created_at": "2025-02-07 19:53:30"
    },
    {
        "id": "10",
        "text": "My feed is filled with depressing news about layoffs across the social impact sector. I'll be resharing as many job opportunities I can find over the next few days. It's the least we can do for each other.",
        "label": 1,
        "created_at": "2025-02-07 20:02:19"
    },
    {
        "id": "11",
        "text": "If you've seen me recently on a video call, you may have noticed that I've been wearing an eye patch. I just wanted to take a quick moment to set the record straight because some folks have asked me about it.\r\n\r\nAbout three weeks ago, I suddenly lost much of the vision in my right eye. Thinking it was a bad case of eye strain, I went to the ophthalmologist. It was there that the doctor looked in my eye and told me that it appeared that I had suffered a hemorrhage. I was sent to a retinal specialist who diagnosed Branch Retinal Vein Occlusion -- basically, there is fluid leaking into my retina. The result is severely distorted vision.\r\n\r\nI'm on a treatment plan for the next year (I'll spare you the details in deference to those of you who may have just eaten lunch). The patch is partly to rest my eye and partly on account of not wanting to gross people out. Long-term prognosis for getting my vision back is iffy -- but without treatment things would most likely get a lot worse. So, treatment it is.\r\n\r\nI don't usually share health related things, but this one is so obvious and public that I wanted to get out in front of it. My job is obviously nothing but a sea of calm and bliss everyday, but if you happen to be in a stressful job and do a lot of screen time, pay attention to the effect on your eyes. Eat healthily, try to relax, and keep those peepers working properly.",
        "label": 1,
        "created_at": "2025-02-07 20:11:08"
    },
    {
        "id": "12",
        "text": "I’m to the point now when I find out I’ve lost a job to another candidate that I’d pay any amount of money to know who they are and see if they have the proven sales experience that I have. \r\n\r\nIt’s all unclear to me now…..",
        "label": 1,
        "created_at": "2025-02-07 20:12:39"
    },
    {
        "id": "13",
        "text": "It's hard not to give up when trying to find a job and receive constant rejections. I've been out of work for months and have been applying for jobs, each one has rejected me. Is it my resume? I would love to get my resume professionally done, but most places charge you hundreds of dollars and I don't have the money to do that. I feel so lost. I'm in a never-ending loop.",
        "label": 1,
        "created_at": "2025-02-07 20:16:26"
    },
    {
        "id": "14",
        "text": "I walked away from a 6-figure tech job at 24 to start a blog about getting girls.\r\n\r\nEveryone thought I was insane.\r\n\r\n10 years and a few business successes later, here's why it was the best decision I could have made for both myself and my future family...\r\n\r\nLet me paint you a picture of \"success\":\r\n\r\n• I was making 6-figures at a cushy government think tank\r\n• I routinely showed up at 9:30\r\n• I routinely took 2-hour lunch breaks\r\n• I routinely left by 4:30\r\n\r\nI reckon I worked less than 2 hours a day on average.\r\n\r\nSounds perfect, right?\r\n\r\nWrong.\r\n\r\nI spent my days watching older coworkers countdown to retirement.\r\n\r\n\"Just 15 more years till I get my pension!\"\r\n\r\nI was 24, looking at these people who had given their entire lives to a cubicle, and I realized:\r\n\r\nI was watching my future if I didn't get out.\r\n\r\nEvery vacation needed approval. Every remote day needed permission. Every promotion went to whoever played politics best. I was basically asking for permission to live my own life.\r\n\r\nThen I took a trip to Colombia.\r\n\r\nMet some guys running online businesses... making $800/month freelancing. They were broke as a joke.\r\n\r\nYet, THEY, not ME, were living life on their terms.\r\n\r\nThey were 10x happier than me in my golden handcuffs.\r\n\r\nDecember 2015:\r\n\r\nCalled my parents: \"I'm quitting my job to go all-in on my anonymous dating blog.\"\r\n\r\nThey thought I was having a quarter-life crisis.\r\n\r\nMaybe I was.\r\n\r\nBut here's the truth about entrepreneurship that nobody tells you:\r\nThe regret of not trying will haunt you more than any failure ever could.\r\nI made myself one rule: Publish something EVERY single day for a year. Blog post, video, or podcast.\r\n\r\nIf I couldn't make it work after a year of pure hustle, I didn't deserve to make it.\r\n\r\nThen something crazy happened:\r\n\r\n• The blog started making money\r\n• Built some niche SEO websites\r\n• Launched an olive oil company\r\n• Started a recruiting firm\r\n• Bought property, got married\r\n\r\nEach win stacked on the next.\r\n\r\nFast forward to 2025: Living life completely on my terms.\r\n\r\nBut it's not all sunshine and rainbows.\r\n\r\nLost my mom to cancer in 2023, aged 58. Life is short. Tomorrow isn't guaranteed. This is why waiting till 65 to \"live your life\" is just...not the way.\r\n\r\nHere's what they don't tell you about the entrepreneurial journey:\r\n\r\nIt never gets easier to ride a bike up a mountain. You just get faster. Today's mountains become tomorrow's speed bumps. If you love your 9-5, keep crushing it. Companies need good people.\r\n\r\nBut if you've got that itch... \r\n\r\nThat voice saying \"there's more\"...\r\n \r\nThat feeling you're meant for more...\r\n\r\nYou owe it to yourself to scratch it.\r\n\r\nBecause one day you'll be on your deathbed...and \"what if\" is the most painful question you can ask yourself.\r\n\r\nMost people will read this, feel something stir inside them, and do absolutely nothing.\r\n\r\nThey'll go back to their cushy job tomorrow. Back to asking permission for vacation. Back to trading their life for a pension.\r\n\r\nDon't be most people.\r\n\r\nYour future self will thank you.",
        "label": 0,
        "created_at": "2025-02-07 20:17:50"
    },
    {
        "id": "15",
        "text": "𝐇𝐨𝐰 𝐝𝐢𝐝 𝐲𝐨𝐮 𝐤𝐧𝐨𝐰 𝐲𝐨𝐮 𝐡𝐚𝐝 𝐛𝐞𝐜𝐨𝐦𝐞 𝐚𝐧 𝐢𝐧𝐟𝐥𝐮𝐞𝐧𝐜𝐞𝐫?\r\n\r\nI'll go first.\r\n\r\n𝘞𝘩𝘦𝘯 𝘵𝘩𝘦 𝘩𝘰𝘴𝘱𝘪𝘵𝘢𝘭, 𝘐 𝘩𝘢𝘥 𝘮𝘺 𝘱𝘰𝘴𝘵-𝘳𝘦𝘨𝘪𝘴𝘵𝘳𝘢𝘵𝘪𝘰𝘯 𝘩𝘰𝘶𝘴𝘦𝘮𝘢𝘯𝘴𝘩𝘪𝘱, 𝘣𝘦𝘤𝘢𝘮𝘦 𝘢 𝘱𝘰𝘱𝘶𝘭𝘢𝘳 𝘩𝘰𝘴𝘱𝘪𝘵𝘢𝘭 𝘤𝘩𝘰𝘪𝘤𝘦 𝘰𝘯 𝘵𝘩𝘦 𝘭𝘪𝘱𝘴 𝘰𝘧 𝘮𝘺 𝘫𝘶𝘯𝘪𝘰𝘳 𝘤𝘰𝘭𝘭𝘦𝘢𝘨𝘶𝘦𝘴 𝘧𝘰𝘳 𝘩𝘰𝘶𝘴𝘦𝘮𝘢𝘯𝘴𝘩𝘪𝘱. \r\n\r\nI have lost count of the DMs I get asking about the hospital and how each person heard I had my house job there. \r\nI've also gotten DMs from foreign-trained Nigerian doctors who follow me and would like to consider this place.\r\n\r\nWhen I'm asked about my experience at Uniosun Teaching Hospital, Osogbo, I find it a bit tricky. It wasn't all sweet, nor was it bitter. It was just suited for me at the time. \r\nI then imagine if this is how the big influencers in the social media space feel—the point where your words almost seem like a verdict.\r\n\r\nIt's interesting to me how that not-so-little decision I made to apply to Association of Resident Doctors, UNIOSUN Teaching Hospital Osogbo. (ARD-UTH) has become a road map for others.\r\n\r\nIronically, when I made the decision to stay at the hospital regardless, it was the lowest paying hospital in the South West.\r\nEvery salary we got felt like an insult, especially when we compared it to other hospitals we knew and heard of.\r\n\r\nDon't get me wrong, the money is quite important. Infact, very important, but there are things (instructions in my case) that far outweigh money.\r\n\r\n𝐈𝐟 𝐡𝐞 𝐝𝐫𝐞𝐬𝐬𝐞𝐬 𝐭𝐡𝐞 𝐥𝐢𝐥𝐲, 𝐡𝐨𝐰 𝐦𝐮𝐜𝐡 𝐦𝐨𝐫𝐞 𝐰𝐢𝐥𝐥 𝐇𝐞 𝐜𝐥𝐨𝐭𝐡𝐞 𝐲𝐨𝐮? (Selah)\r\n\r\nIt's a year after, and that very uncommon choice is becoming a major consideration for people I have slowly but surely influenced by sticking with a personal growth and display excellence even when there is allowance for mediocrity.\r\n\r\nThe growth, influence, worthy connections, knowledge and insight I have received for my journey by obeying the prompt to apply only to Uniosun Teaching Hospital, has brought me far greater blessings than I can share and could ever remember to number.\r\n\r\nI'm reminded that my life is a testament to what God can do with yieldedness.\r\n\r\nHappy weekends.",
        "label": 0,
        "created_at": "2025-02-07 20:19:26"
    },
    {
        "id": "16",
        "text": "I just need to make money, but I don’t know how.”\r\n\r\nThat’s what one of my students told me last year. She was feeling lost, unsure of her next step, and frustrated by her financial situation. But as we talked, she casually mentioned her love for cooking—how she created unique recipes and how much people loved her meals.\r\n\r\nI stopped her right there. \"Do you realize you’re sitting on a business?\"\r\n\r\nShe had a gift, but like so many women—especially immigrant women—she didn’t see it as valuable enough to build a business around. We’re taught to look for “traditional” jobs, not to trust what comes naturally to us.\r\n\r\nI walked her through how she could turn her passion into a profitable side hustle. She started small with catering. Then, as she gained confidence, she expanded into meal prep services. Now? She’s hosting cooking classes and working on her first cookbook.\r\n\r\nThis is the power of monetizing your skills.\r\n\r\n➡️ Your skills are your currency. If you can teach it, create it, or solve a problem with it—you can sell it.\r\n➡️ Digital business is scalable. From online classes to e-books and coaching, you can earn without trading time for money.\r\n➡️ God gave you gifts for a reason. Proverbs 18:16 says, \"A man's gift makes room for him and brings him before great men.\" Your talents are meant to open doors.",
        "label": 0,
        "created_at": "2025-02-07 20:26:47"
    },
    {
        "id": "17",
        "text": "WAKE-UP CALL! \r\nAre you tired of feeling stuck in your career? Are you struggling to establish a strong personal brand? I know I was! Just a few weeks ago, I was lost, uncertain, and frustrated. But then, everything changed! My mentor, Balemba Cecilia Kalang, stepped into my life and transformed my branding journey! Here's what I'm learning from Cecilia:\r\n\r\n✅Consistency is Key: Cecilia has taught me the importance of showing up consistently, both online and offline. By doing so, I've built trust with my audience and established myself as a credible authority in my niche.\r\n✅Persistence Pays Off: Cecilia's mantra is \"don't give up, even when it's hard.\" She's shown me that persistence is what separates successful people from those who give up. I've learned to push through challenges and keep moving forward.\r\n✅Adaptability is Essential: The job market and industry trends are constantly changing. Cecilia has taught me to be adaptable and open to new ideas. This has helped me stay ahead of the curve and remain relevant.\r\n✅Establishing Authority: Cecilia has shown me how to establish myself as an authority in my niche. By creating valuable content, engaging with my audience, and showcasing my expertise.\r\n\r\nAnd now, I'm excited to announce that Cecilia will be leading an upcoming beginner graphics class, starting this Tuesday! DON'T MISS OUT!\r\n\r\nJoin us and gain:\r\n-Everlasting coaching\r\n-Certification to boost your credibility\r\n-Access to a supportive community of like-minded learners\r\n\r\nWhat's amazing about Cecilia is that she doesn't just tell you how to do it - she SHOWS you how to catch the fish! Many mentors stop at theory, but Cecilia provides hands-on guidance and support to make you the best!\r\n\r\nCecilia is an incredible mentor, and I'm living proof of her impact! SIGN UP NOW and transform your design skills! Don't wait – secure your spot today!\r\n\r\nI am Arrey E. Beyang, your best top female job search strategist.",
        "label": 0,
        "created_at": "2025-02-07 20:35:14"
    },
    {
        "id": "18",
        "text": "In life, I think you can measure your wealth by the friendships you collect along the way. \r\n\r\nOne of my favorite people on the planet is this guy, Tarkan Maner. \r\n\r\nA mentor and dear friend for the past two plus decades. As we embark on 2025, it was great to spend an afternoon bouncing ideas off each other and catching up on all things tech, EUC and beyond…\r\n\r\nSmart as hell, selfless and he’s always treated my like his kid brother. He got the better looks and hair though! ",
        "label": 1,
        "created_at": "2025-02-07 20:55:19"
    },
    {
        "id": "19",
        "text": "Florence Agboma raises some important questions about the business case for low latency streaming and the need for standardized measurement. She explains how low latency is achieved with current DASH and HLS implementations and what to consider with your video player experiences. Great podcast! Subscribe to the series here: ",
        "label": 1,
        "created_at": "2025-02-07 21:04:01"
    },
    {
        "id": "20",
        "text": "For what it's worth, this has been true for at least 24.75 of the last 25 years. It's been decades (at least three, possibly four) since an MBA gave the holder any sort of advantage when it comes to closing on a job opportunity.\r\n\r\nAn MBA is a single criterion on a job application—albeit a wildly expensive one—no different than Years of Experience or knowledge of a specific programming language. It allows candidates to check yet another box and (hopefully) earn a pass to the next step, whatever that step may be.\r\n\r\nBut at the same time, when 8 out of every 10 middle management or above roles on LinkedIn indiscriminately lists an MBA as \"preferred\" for seemingly no good reason, people who want to craft a long-term career in business have little choice but to invest in one.\r\n\r\nYou can't blame people for lining up to spend the money for an MBA when the next step on their career ladders is invisible without it.",
        "label": 1,
        "created_at": "2025-02-07 21:07:02"
    },
    {
        "id": "29",
        "text": "A simple strategy that changes 30 lives every morning:\r\n\r\nWhat if a simple choice could reshape a student's entire school day? \r\n\r\nOne teacher found that offering students a menu of greeting options – from a high-five to a quiet \"good morning\" – made a world of difference. \r\n\r\nStudents now arrive excited to choose their preferred interaction, leading to increased participation and a more positive classroom atmosphere. \r\n\r\nThis approach respects individual boundaries, builds trust, and cultivates emotional intelligence. \r\n\r\nIt underscores the importance of acknowledging each person's comfort level and prioritizing their well-being. \r\n\r\nHere's how it works:\r\n\r\nEach student gets to choose their preferred way to start the day:\r\n- A gentle high-five\r\n- A quick hug\r\n- A friendly fist bump\r\n- A simple smile and nod\r\n- A quiet \"good morning\"\r\n\r\nWhat makes this approach powerful is its simplicity. It:\r\n- Respects personal boundaries\r\n- Builds trust\r\n- Creates a safe space\r\n- Teaches emotional awareness\r\n- Promotes daily positive interactions\r\n\r\nThis isn't just about starting the day right – \r\nit's about teaching our children that their comfort matters, \r\ntheir choices count, and their well-being is priority.\r\n\r\nWhat if we all took a moment each day to ask others how they'd like to be greeted? \r\n\r\nSometimes, the smallest changes create the biggest impact.",
        "label": 0,
        "created_at": "2025-03-02 17:26:23"
    },
    {
        "id": "30",
        "text": "I am afraid it is impossible to be able to know when someone's words are sincere or not, it may seem sincere to us and yet it may not be.\r\n\r\nFor you see, what a person says is not for us to determine whether it's sincere or not for only he alone knows the truth.\r\n\r\nHowever, we have multitudes of quotes, from people who I believe were sincere when they wrote them. And we have learned from them, and it is hard to single one out.",
        "label": 1,
        "created_at": "2025-03-02 21:45:01"
    }
]